000_РОЗНИЦА_ЦЕНТР/src/Catalogs/КафкаБрокеры/КафкаБрокеры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>КафкаБрокеры</name>
  <tabularSections>
    <name>Узлы</name>
    <attributes>
      <name>Использование</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Адрес</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>512</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПараметрыПодключения</name>
    <attributes>
      <name>Ключ</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>128</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>256</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>РежимПароля</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

000_РОЗНИЦА_ЦЕНТР/src/Catalogs/КафкаПродюсеры/КафкаПродюсеры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>КафкаПродюсеры</name>
  <attributes>
    <name>Брокер</name>
    <type>
      <types>CatalogRef.КафкаБрокеры</types>
    </type>
  </attributes>
  <attributes>
    <name>РежимАсинх</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьПакетнуюПубликацию</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ПараметрыПродюсера</name>
    <attributes>
      <name>Ключ</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>128</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>128</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

000_РОЗНИЦА_ЦЕНТР/src/Catalogs/КафкаКонсьюмеры/КафкаКонсьюмеры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>КафкаКонсьюмеры</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>Брокер</name>
    <type>
      <types>CatalogRef.КафкаБрокеры</types>
    </type>
  </attributes>
  <attributes>
    <name>Идентификатор</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>128</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТаймаутОжидания</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДвоичныеДанные</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>БлокироватьЧтение</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>БлокироватьДесериализацию</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодпотокиОбработки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПодпотокиТранспорта</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Топики</name>
    <attributes>
      <name>Топик</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>128</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТипДесериализации</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИмяМетодаДесериализации</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИмяМодуляДесериализации</name>
      <comment>Менеджер обмена (КД 3.1)</comment>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>120</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИмяПОДДесериализации</name>
      <comment>Имя ПОД (КД 3.1)</comment>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>120</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ФорматДесериализации</name>
      <comment>Формат (КД 3.1)</comment>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>120</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПараметрыКонсьюмера</name>
    <attributes>
      <name>Ключ</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>128</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>128</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

000_РОЗНИЦА_ЦЕНТР/src/CommonModules/КафкаИнтеграцияСлужебный/Module.bsl
///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2026, ShadobaAI
// Этот файл является частью программного обеспечения, распространяемого на условиях
// Mozilla Public License, версия 2.0 (MPL-2.0).
// Текст лицензии доступен по ссылке:
// https://mozilla.org/MPL/2.0/
///////////////////////////////////////////////////////////////////////////////////////////////////////

// @strict-types
#Область СлужебныйПрограммныйИнтерфейс

#Область Администрирование

// Проверка подключения к брокеру.
// 
// Параметры:
//	Брокеры - Массив Из Строка - Брокер или Список узлов брокера.
//	ПараметрыПодключения - Соответствие Из КлючИЗначение - Параметры подключения:
//	 * Ключ - Строка - Имя параметра подключения
//	 * Значение - Произвольный - Значение параметра подключения 
// 
// Возвращаемое значение:
//	Структура - Результат проверки подключения к брокеру:
//	 * Статусы - Соответствие Из КлючИЗначение - Статус подключения:
//	  ** Ключ - Строка - Имя брокера/узла
//	  ** Значение - Булево - Истина, если подключение успешно
//	 * ТекстЖурнала - Строка - Текст журнала проверки подключения
Функция ПроверитьПодключениеКБрокеруВФоне(Брокеры, ПараметрыПодключения) Экспорт
	
	Статусы = Новый Соответствие;
	ТекстЖурнала = Новый ТекстовыйДокумент;
	
	РазделительЖурнала = СтроковыеФункцииКлиентСервер.СформироватьСтрокуСимволов("-", 150);
	
	ПутьККаталогу = ОбщегоНазначенияКлиентСервер.ДобавитьКонечныйРазделительПути(ПолучитьИмяВременногоФайла());
	СоздатьКаталог(ПутьККаталогу);
	Логи = ПутьККаталогу;
	
	Коннектор = Обработки.КафкаИнтеграция.Создать();
	Коннектор.УстановитьКаталогЛогов(Логи, "");
	Коннектор.УстановитьПараметры(ПараметрыПодключения);
	Коннектор.УстановитьПараметр("statistics.interval.ms", "5000"); // 5 сек.
	Коннектор.УстановитьРежимОтладки("all");
	// Продюсер
	Коннектор.ИнициализироватьПродюсера(Брокеры);
	ОбщегоНазначенияКлиентСервер.Пауза(5500); // 5.5 сек.
	Коннектор.ОстановитьПродюсера();
//	// Консьюмер
//	Коннектор.УстановитьПараметр("group.id", "PING-CONNECT");
//	Коннектор.ИнициализироватьКонсьюмера(Брокеры);
//	ОбщегоНазначенияКлиентСервер.Пауза(5500); // 5.5 сек.
//	Коннектор.ОстановитьПродюсера();
	Коннектор = Неопределено;
	
	// ЛОГИ:Продюсер
	ТекстЛогаПродюсер = "";
	Для Каждого Файл Из НайтиФайлы(Логи, "producer_*_.log") Цикл
		Чтение = Новый ЧтениеТекста(Файл.ПолноеИмя);
		ТекстЛогаПродюсер = Чтение.Прочитать();
		Чтение.Закрыть();
	КонецЦикла;
	Если ПустаяСтрока(ТекстЛогаПродюсер) Тогда
		ВызватьИсключение НСтр("ru = 'Не удалось получить логи продюсера.'");
	КонецЕсли;
	ТекстЖурнала.ДобавитьСтроку(ТекстЛогаПродюсер);
	ТекстЖурнала.ДобавитьСтроку(РазделительЖурнала);
	ТекстЖурнала.ДобавитьСтроку("");
//	// ЛОГИ:Консьюмер
//	ТекстЛогаКонсьюмер = "";
//	Для Каждого Файл Из НайтиФайлы(Логи, "consumer_*_.log") Цикл
//		Чтение = Новый ЧтениеТекста(Файл.ПолноеИмя);
//		ТекстЛогаКонсьюмер = Чтение.Прочитать();
//		Чтение.Закрыть();
//	КонецЦикла;
//	Если ПустаяСтрока(ТекстЛогаКонсьюмер) Тогда
//		ВызватьИсключение НСтр("ru = 'Не удалось получить логи консьюмера.'");
//	КонецЕсли;
//	ТекстЖурнала.ДобавитьСтроку(ТекстЛогаКонсьюмер);
//	ТекстЖурнала.ДобавитьСтроку(РазделительЖурнала);
//	ТекстЖурнала.ДобавитьСтроку("");
	// Статистика, см. https://github.com/NuclearAPK/Simple-Kafka_Adapter/blob/main/statistic.md
	ТекстСтатистики = "";
	Для Каждого Файл Из НайтиФайлы(Логи, "statistics_*_.log") Цикл
		Чтение = Новый ЧтениеТекста(Файл.ПолноеИмя);
		ТекстСтатистики = Чтение.Прочитать();
		Чтение.Закрыть();
	КонецЦикла;
	Если ПустаяСтрока(ТекстСтатистики) Тогда
		ВызватьИсключение НСтр("ru = 'Не удалось получить статистику.'");
	КонецЕсли;
	ТекстЖурнала.ДобавитьСтроку(ТекстСтатистики);
	ТекстJSON = СтрЗаменитьПоРегулярномуВыражению(ТекстСтатистики, "^[^{]+", "", , Истина);
	ТекстJSON = СокрЛП(ТекстJSON);
	ТекстJSON = СтрЗаменитьПоРегулярномуВыражению(ТекстJSON, "\n", ",", , Истина);
	ТекстJSON = СтрШаблон("[%1]", ТекстJSON);
	ВсяСтатистика = РаботаСJSONСервер.JSONВЗначение(ТекстJSON); // Массив Из Соответствие
	Для Каждого Статистика Из ВсяСтатистика Цикл
		Для Каждого КлючИЗначение Из Статистика["brokers"] Цикл // Соответствие
			//@skip-check property-return-type
			Если КлючИЗначение.Ключ = "GroupCoordinator" Тогда
				Продолжить;
			КонецЕсли;
			//@skip-check property-return-type
			Брокер = КлючИЗначение.Значение; // Соответствие
			ИмяУзла = Брокер["nodename"]; // Строка
			
			Значение = Статусы.Получить(ИмяУзла);
			Значение = ?(Значение = Неопределено, Истина, Значение); // Булево
			Значение = Значение И Брокер["nodeid"] >= 0 И Брокер["source"] = "learned";
			// И Брокер["state"] = "UP" И (Брокер["rxbytes"] > 0 Или Брокер["txbytes"] > 0); - только у лидера
			
			Статусы.Вставить(ИмяУзла, Значение);
			
		КонецЦикла;
	КонецЦикла;
	Для Каждого Брокер Из Брокеры Цикл
		Если Статусы.Получить(Брокер) = Неопределено Тогда
			Статусы.Вставить(Брокер, Ложь);
		КонецЕсли;
	КонецЦикла;
	
	УдалитьФайлы(Логи);
	
	Возврат Новый Структура("Статусы, ТекстЖурнала", Статусы, ТекстЖурнала.ПолучитьТекст());
		
КонецФункции

// Новое описание свойства librdkafka, см. КафкаИнтеграцияСлужебныйПовтИсп.СвойстваLibrdKafka
// 
// Возвращаемое значение:
//	Структура - Новое описание свойства librd kafka:
//	 * ДоступныеЗначения - Неопределено, Строка, ФиксированныйМассив Из Строка - Доступные строковые значения
//	 * ДоступныеЗначенияОт - Неопределено, Число - Доступные число 'ОТ'
//	 * ДоступныеЗначенияДо - Неопределено, Число - Доступные число 'ДО'
//	 * ЗначениеПоУмолчанию - Неопределено, Строка, Число - Значение по умолчанию
//	 * ЗначениеПоУмолчаниюСтрокой - Строка - Значение по умолчанию строкой
//	 * ТипЗначения - Строка - Тип значения: string, bool, float, int, enum, list|string 
//	 * Важность - Число - Важность, 1 - Низкая, 2 - Средняя, 3 - Высокая
//	 * БыстрыйДоступ - Булево - Быстрый доступ
//	 * Описание - Строка - Описание
Функция НовоеОписаниеСвойстваLibrdKafka() Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("ТипЗначения", "");
	Результат.Вставить("ДоступныеЗначения", Неопределено);
	Результат.Вставить("ДоступныеЗначенияОт", Неопределено);
	Результат.Вставить("ДоступныеЗначенияДо", Неопределено);
	Результат.Вставить("ЗначениеПоУмолчанию", Неопределено);
	Результат.Вставить("ЗначениеПоУмолчаниюСтрокой", "");
	Результат.Вставить("Важность", 0);
	Результат.Вставить("БыстрыйДоступ", Ложь);
	Результат.Вставить("Описание", "");
	
	Возврат Результат;
	
КонецФункции

// Доступные топики.
// 
// Параметры:
//	Брокер - СправочникСсылка.КафкаБрокеры - Брокер
// 
// Возвращаемое значение:
//	Массив Из Строка - Доступные топики
Функция ДоступныеТопики(Брокер) Экспорт
	
	Результат = Новый Массив; // Массив Из Строка
	
	АдресБрокера = ?(ТипЗнч(Брокер) = Тип("Строка"), Брокер, Справочники.КафкаБрокеры.АдресБрокера(Брокер));
	Если ПустаяСтрока(АдресБрокера) Тогда
		Возврат Результат;
	КонецЕсли;
	
	Коннектор = Обработки.КафкаИнтеграция.Создать();
	СписокТопиков = Коннектор.ПолучитьСписокТопиков(АдресБрокера);
	Если СписокТопиков = Неопределено Тогда
		Возврат Результат;
	КонецЕсли;
	
	СистемныеТопики = Новый Массив; // Массив Из Строка
	СистемныеТопики.Добавить("__consumer_offsets");
	СистемныеТопики.Добавить("__transaction_state");
	СистемныеТопики.Добавить("__cluster_metadata");
	СистемныеТопики.Добавить("__amazon_msk_canary");
	СистемныеТопики.Добавить("_schemas");
	
	Для Каждого Топик Из СписокТопиков.topics Цикл
		Если СистемныеТопики.Найти(Топик.topic) = Неопределено Тогда
			Результат.Добавить(Топик.topic);
		КонецЕсли;
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область ПубликацияСообщений

// Отправляет данные на указанный продюсер.
// 
// Параметры:
//  Продюсер - СправочникСсылка.КафкаПродюсеры - Экземпляра продюсер
//  ИмяТопика - Строка - Имя топика
//  Сообщение - Структура - Описание сообщения, см. КафкаИнтеграция.ПараметрыСообщения:
//		* Данные - Строка, ДвоичныеДанные, Структура - Тело сообщения;
//		* Ключ - Строка - Уникальный идентификатор сообщения;
//		* Заголовки - Соответствие Из КлючИЗначение - Заголовки сообщения:
//			** Ключ - Строка - Имя заголовка;
//			** Значение - Строка - Значение заголовка
//	Партиция - Число - Номер партиции
//	Сессии - Неопределено - При вызове создаётся новое подключение.
//							После завершения операции соединение автоматически закрывается.
//							Подходит для одноразовых вызовов, но менее эффективно при большом потоке сообщений.
//		   - Соответствие Из ОбработкаОбъект.КафкаИнтеграция - Используется ранее созданное подключение.
//							Если объект передаётся впервые, подключение создаётся автоматически и остаётся открытым для последующих вызовов.
//							Для завершения работы соединения необходимо явным образом вызвать метод ЗавершитьСессии().
//							Подходит для пакетной/массовой отправки сообщений.
// 
// Возвращаемое значение:
//	Структура - Результат отправки сообщения, КафкаИнтеграция.РезультатИнтеграции():
//	 * Успешно - Булево - Признак успешной отправки всех сообщений.
//	 * ТекстОшибки - Строка - Текст общих ошибок
Функция Отправить(Продюсер, ИмяТопика, Сообщение, Партиция = -1, Сессии = Неопределено) Экспорт
	
	Результат = КафкаИнтеграция.РезультатИнтеграции();
	Результат.Успешно = Истина;
	
	Коннектор = СессияПродюсера(Продюсер, Сессии, Результат);
	Если Не Результат.Успешно Тогда
		Возврат Результат;
	КонецЕсли;
	
	Тело = ТелоСообщения(Сообщение, Результат.ТекстОшибки);
	Если Тело = Неопределено Тогда
		Результат.Успешно = Ложь;
		Возврат Результат;
	КонецЕсли;
	
	Коннектор.УстановитьРежимОтладки("generic, broker, topic, metadata, feature, queue, msg, protocol, cgrp, security, fetch, interceptor, plugin, consumer, admin, eos, mock, assignor, conf, all");
	
	Статус = Коннектор.ОтправитьСообщение(Тело, ИмяТопика, Партиция, Сообщение.Ключ, Сообщение.Заголовки);
	Если Статус = -1 Или Статус = 0 Тогда
		Результат.Успешно = Ложь;
		Результат.ТекстОшибки = Коннектор.ПолучитьСообщениеОбОшибке();
		Возврат Результат;
	КонецЕсли;
	
	Если Сессии = Неопределено Тогда
		Коннектор.ОстановитьПродюсера();
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Отправляет данные на указанный продюсер.
// 
// Параметры:
//  Продюсер - СправочникСсылка.КафкаПродюсеры - Экземпляра продюсер
//  ИмяТопика - Строка - Имя топика
//  Сообщения - Массив Из Структура - Описание сообщения, см. КафкаИнтеграция.ПараметрыСообщения:
//		* message - Строка - (обязательное) Тело сообщения.
//		* key - Строка - (необязательное) Ключ сообщения.
//		* partition - Число - (необязательное) Номер партиции. Если не указан, используется -1 (автоматический выбор).
//		* headers - Строка - (необязательное) Заголовки в формате "ключ1,значение1;ключ2,значение2".
//	Сессии - Неопределено - При вызове создаётся новое подключение.
//							После завершения операции соединение автоматически закрывается.
//							Подходит для одноразовых вызовов, но менее эффективно при большом потоке сообщений.
//		   - Соответствие Из ОбработкаОбъект.КафкаИнтеграция - Используется ранее созданное подключение.
//							Если объект передаётся впервые, подключение создаётся автоматически и остаётся открытым для последующих вызовов.
//							Для завершения работы соединения необходимо явным образом вызвать метод ЗавершитьСессии().
//							Подходит для пакетной/массовой отправки сообщений.
// 
// Возвращаемое значение:
//	Структура - Результат отправки сообщения, КафкаИнтеграция.РезультатИнтеграции():
//	 * Успешно - Булево - Признак успешной отправки всех сообщений.
//	 * ТекстОшибки - Строка - Текст общих ошибок
Функция ОтправитьПакетСообщений(Продюсер, ИмяТопика, Сообщения, Сессии = Неопределено) Экспорт
	
	Результат = КафкаИнтеграция.РезультатИнтеграции();
	Результат.Успешно = Истина;
	
	Коннектор = СессияПродюсера(Продюсер, Сессии, Результат);
	Если Не Результат.Успешно Тогда
		Возврат Результат;
	КонецЕсли;
	
	КоличествоОтправленных = Коннектор.ОтправитьПакетСообщений(Сообщения, ИмяТопика);
	Если КоличествоОтправленных = -1 Тогда
		Результат.Успешно = Ложь;
		Результат.ТекстОшибки = Коннектор.ПолучитьСообщениеОбОшибке();
		Возврат Результат;
		
	ИначеЕсли КоличествоОтправленных < Сообщения.Количество() Тогда
		Результат.Успешно = Ложь;
		Результат.ТекстОшибки = Коннектор.ПолучитьСообщениеОбОшибке();
		Если ПустаяСтрока(Результат.ТекстОшибки) Тогда
			Результат.ТекстОшибки = СтрШаблон(НСтр("ru = 'Не удалось отправить %1'"), ПолучитьСклоненияСтрокиПоЧислу(
				НСтр("ru = 'сообщение'"), Сообщения.Количество() - КоличествоОтправленных)[0]);
		КонецЕсли;
		
	КонецЕсли;
	
	Если Сессии = Неопределено Тогда
		Коннектор.ОстановитьПродюсера();
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Заголовки пакетного сообщения.
// 
// Параметры:
//	Заголовки - Соответствие Из КлючИЗначение - Заголовки:
//	 * Ключ - Строка - Имя заголовка.
//	 * Значение - Строка - Значение заголовка.
//	
// Возвращаемое значение:
//	Строка - Заголовки в формате "ключ1,значение1;ключ2,значение2".
Функция ЗаголовкиПакетногоСообщения(Заголовки) Экспорт
	
	Если Заголовки.Количество() = 0 Тогда
		Возврат "";
	КонецЕсли;
	
	Результат = Новый Массив; // Массив Из Строка
	Для Каждого КлючЗначение Из Заголовки Цикл
		Результат.Добавить(XMLСтрока(КлючЗначение.Ключ) + "," + XMLСтрока(КлючЗначение.Значение));
	КонецЦикла;
	
	Возврат СтрСоединить(Результат, ";");
	
КонецФункции

// Закрыть сессии продюсера.
// 
// Параметры:
//  Сессии - Соответствие Из ОбработкаОбъект.КафкаИнтеграция - Ранее созданные подключения. см. Отправить и Прочитать
Процедура ЗакрытьСессииПродюсера(Сессии) Экспорт
	
	Для Каждого Сессия Из Сессии Цикл
		//@skip-check property-return-type
		//@skip-check bsl-legacy-check-static-feature-access-for-unknown-left-part
		Коннектор = Сессия.Значение; // ОбработкаОбъект.КафкаИнтеграция
		Коннектор.ОстановитьПродюсера();
	КонецЦикла;
	
КонецПроцедуры

// Формирует тело сообщение для отправки в Kafka
// 
// Параметры:
//  Сообщение - Структура - Параметры сообщения, см. КафкаИнтеграция.ПараметрыСообщения:
//	 * Данные - Строка, ДвоичныеДанные, Структура, Массив Из Структура - Тело сообщения
//  ТекстОшибки - Строка - Текст ошибки
// 
// Возвращаемое значение:
//  Неопределено, Строка, ДвоичныеДанные - Тело сообщения
Функция ТелоСообщения(Сообщение, ТекстОшибки = "") Экспорт

	Результат = Неопределено; // Неопределено, Строка, ДвоичныеДанные
	
	ТДанные = ТипЗнч(Сообщение.Данные);
	Если ТДанные = Тип("Строка") Или ТДанные = Тип("ДвоичныеДанные") Тогда
		Результат = Сообщение.Данные;
		
	ИначеЕсли ТДанные = Тип("Структура") Или ТДанные = Тип("ФиксированнаяСтруктура")
			Или ТДанные = Тип("Соответствие") Или ТДанные = Тип("ФиксированноеСоответствие")
			Или ТДанные = Тип("Массив") Или ТДанные = Тип("ФиксированныйМассив") Тогда
		
		Попытка
			
			Результат = КафкаОбщегоНазначенияСлужебный.ЗначениеВJSON(Сообщение.Данные); // Строка
			
		Исключение
			ТекстОшибки = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		КонецПопытки;

	Иначе
		ТекстОшибки = НСтр("ru = 'Неподдерживаемый тип передачи данных!'", "ru");
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область ЧтениеСообщений

// Читает очередь консьюмера
// 
// Параметры:
//	Консьюмер - СправочникСсылка.КафкаКонсьюмеры - Консьюмер
//	АвтоФиксацияСмещения - Булево - Автоматически и периодически фиксировать смещения в фоновом режиме.
//	Сессии - Неопределено - При вызове создаётся новое подключение.
//							После завершения операции соединение автоматически закрывается.
//							Подходит для одноразовых вызовов, но менее эффективно при большом потоке сообщений.
//		   - Соответствие Из ОбработкаОбъект.КафкаИнтеграция - Используется ранее созданное подключение.
//							Если объект передаётся впервые, подключение создаётся автоматически и остаётся открытым для последующих вызовов.
//							Для фиксации смещения в Кафке необходимо явным образом вызвать метод ЗафиксироватьСмещение().
//							Для завершения работы соединения необходимо явным образом вызвать метод ЗавершитьСессии().
//							Подходит для пакетной/массовой отправки сообщений.
//  
// Возвращаемое значение:
//	Структура - Результат отправки сообщения:
//	 * Успешно - Булево - Признак успешного чтения.
//	 * ТекстОшибки - Строка - Текст общих ошибок
//	 * Сообщение - Неопределено, Структура - Полученное сообщение, см. ОписаниеПолученногоСообщения:
//		** Тело - Строка, ДвоичныеДанные - Данные сообщения
//		** Ключ - Строка - ключ сообщения (key)
//		** Заголовки - Массив Из Структура - массив заголовков, каждый заголовок состоит из ключа и значения (key, value)
//		** Топик - Строка - Имя топика.
//		** ВременнаяМетка - Число - Фактическое время записи сообщения в топик и указанный раздел.
//		** Раздел - Число - Номер партиции.
//		** Смещение - Число - Текущее смещение сообщения (offset).
Функция Прочитать(Консьюмер, АвтоФиксацияСмещения, Сессии = Неопределено) Экспорт
	
	Результат = КафкаИнтеграция.РезультатИнтеграции();
	Результат.Успешно = Истина;
	Результат.Вставить("Сообщение", Неопределено);
	
	Коннектор = СессияКонсьюмера(Консьюмер, АвтоФиксацияСмещения, Сессии, Результат);
	Если Не Результат.Успешно Тогда
		Возврат Результат;
	КонецЕсли;
	
	Если Коннектор.ПрочитатьСообщение() Тогда
		
		Данные = Коннектор.ДанныеПрочитанногоСообщения();
		
		Результат.Сообщение = ОписаниеПолученногоСообщения();
		ЗаполнитьЗначенияСвойств(Результат.Сообщение, Данные);
		
		// Зафиксировать смещение в Кафке
		Если Сессии = Неопределено Тогда
			Коннектор.ЗафиксироватьСмещение(Данные.Топик, Данные.Смещение + 1, Данные.Раздел);
		КонецЕсли;
		
	КонецЕсли;
	
	Если Сессии = Неопределено Тогда
		Коннектор.ОстановитьКонсьюмера();
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Пакетное чтение очереди консьюмера
// 
// Параметры:
//	Консьюмер - СправочникСсылка.КафкаКонсьюмеры - Консьюмер
//	Топики - Неопределено - Топики из настроек консьюмера, автоматическое назначение партиций 
//			- Массив Из Строка - Подписка на указанные топики, автоматическое назначение партиций
//			- Массив Из Структура - Подписка на указанные топики, см. ручное назначение партиций:
//				* ИмяТопика - Строка - Имя топика
//				* Партиция - Число - Партиция
//	АвтоФиксацияСмещения - Булево - Автоматически и периодически фиксировать смещения в фоновом режиме.
//	МаксимальноеКоличество - Число - Максимальное количество сообщений для чтения
//	Сессии - Неопределено - При вызове создаётся новое подключение.
//							После завершения операции соединение автоматически закрывается.
//							Подходит для одноразовых вызовов, но менее эффективно при большом потоке сообщений.
//		   - Соответствие Из ОбработкаОбъект.КафкаИнтеграция - Используется ранее созданное подключение.
//							Если объект передаётся впервые, подключение создаётся автоматически и остаётся открытым для последующих вызовов.
//							Для фиксации смещения в Кафке необходимо явным образом вызвать метод ЗафиксироватьСмещение().
//							Для завершения работы соединения необходимо явным образом вызвать метод ЗавершитьСессии().
//							Подходит для пакетной/массовой отправки сообщений.
//	ИдентификаторСессии - Неопределено, Произвольный - Идентификатор сессии
//  
// Возвращаемое значение:
//	Структура - Результат отправки сообщения:
//	 * Успешно - Булево - Признак успешного чтения.
//	 * ТекстОшибки - Строка - Текст общих ошибок
//	 * Сообщения - Массив Из Структура - Полученное сообщение:
//		** message - Строка, ДвоичныеДанные - Данные сообщения
//		** key - Строка - ключ сообщения (key)
//		** headers - Массив Из Структура - массив заголовков, каждый заголовок состоит из ключа и значения (key, value)
//		** topic - Строка - Имя топика.
//		** timestamp - Число - Фактическое время записи сообщения в топик и указанный раздел.
//		** partition - Число - Номер партиции.
//		** offset - Число - Текущее смещение сообщения (offset).
//		** broker_id - Строка - ID брокера
Функция ПрочитатьПакетСообщений(Консьюмер, АвтоФиксацияСмещения, МаксимальноеКоличество = 100, Сессии = Неопределено) Экспорт
	
	Результат = КафкаИнтеграция.РезультатИнтеграции();
	Результат.Успешно = Истина;
	Результат.Вставить("Сообщения", Новый Массив);
	
	Коннектор = СессияКонсьюмера(Консьюмер, АвтоФиксацияСмещения, Сессии, Результат);
	Если Не Результат.Успешно Тогда
		Возврат Результат;
	КонецЕсли;
	
	ПакетСообщений = Коннектор.ЧитатьПакетСообщений(МаксимальноеКоличество); // Соответствие
	Сообщения = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ПакетСообщений, "messages", Результат.Сообщения); // Массив Из Структура
	Результат.Сообщения = Сообщения;
	
	Результат.ТекстОшибки = Коннектор.ПолучитьСообщениеОбОшибке();
	
	// Зафиксировать смещение в Кафке
	Если Сессии = Неопределено Тогда
		Коннектор.ОстановитьКонсьюмера();
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Зафиксировать смещение.
// 
// Параметры:
//	Консьюмер - СправочникСсылка.КафкаКонсьюмеры - Консьюмер
//	Сессии - Соответствие Из ОбработкаОбъект.КафкаИнтеграция - Ранее созданные подключения. см. Прочитать
//	ПараметрыСмещения  - Структура - Параметры смещения:
//	 * Топик - Строка - Имя топика
//	 * Смещение - Число - Значение смещения прочитанного сообщения.
//	 * Раздел - Число - Номер раздела.
//
// Возвращаемое значение:
//	Структура - Результат отправки сообщения:
//	 * Успешно - Булево - Признак успешного чтения.
//	 * ТекстОшибки - Строка - Текст общих ошибок
Функция ЗафиксироватьСмещение(Консьюмер, Сессии, ПараметрыСмещения) Экспорт
	
	Результат = КафкаИнтеграция.РезультатИнтеграции();
	
	Коннектор = Сессии.Получить(Консьюмер); // ОбработкаОбъект.КафкаИнтеграция
	
	Результат.Успешно = Коннектор.ЗафиксироватьСмещение(ПараметрыСмещения.Топик, ПараметрыСмещения.Смещение+1, ПараметрыСмещения.Раздел);
	Если Не Результат.Успешно Тогда
		Результат.ТекстОшибки = Коннектор.ПолучитьСообщениеОбОшибке();
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Закрыть сессии консьюмера.
// 
// Параметры:
//	Сессии - Соответствие Из КлючИЗначение - Ранее созданные подключения. см. Отправить и Прочитать
//	 * Ключ СправочникСсылка.КафкаКонсьюмеры - Консьюмер
//	 * Значение - ОбработкаОбъект.КафкаИнтеграция - Сессия
Процедура ЗакрытьСессииКонсьюмера(Сессии) Экспорт
	
	Для Каждого Сессия Из Сессии Цикл
		Коннектор = Сессия.Значение; // ОбработкаОбъект.КафкаИнтеграция
		Если Коннектор <> Неопределено Тогда
			Коннектор.ОстановитьКонсьюмера();
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура УстановитьКаталогЛогов(Коннектор)
	
	Параметры = КафкаИнтеграцияСлужебныйПовтИсп.ПараметрыЛогированияКомпоненты();
	
	Коннектор.УстановитьКаталогЛогов(Параметры.КаталогЛогов, Параметры.ФорматИмениФайлов);
	
КонецПроцедуры

#Область ПубликацияСообщений

// Новый коннектор продюсера.
// 
// Параметры:
//  Продюсер - СправочникСсылка.КафкаПродюсеры - Ссылка на продюсер
//  Статус - Структура - Результат интеграции. см. КафкаИнтеграция.РезультатИнтеграции
// 
// Возвращаемое значение:
//  Неопределено, ОбработкаОбъект.КафкаИнтеграция - Новый коннектор продюсера
Функция НовыйКоннекторПродюсера(Продюсер, Статус)
	
	Настройки = Справочники.КафкаПродюсеры.ОписаниеПродюсера(Продюсер);
	Если Не ЗначениеЗаполнено(Настройки.Ссылка) Тогда
		Статус.Успешно = Ложь;
		Статус.ТекстОшибки = НСтр("ru = 'Продюсер отключён!'", "ru");
		Возврат Неопределено;
	КонецЕсли;
	
	Коннектор = Обработки.КафкаИнтеграция.Создать();
	УстановитьКаталогЛогов(Коннектор);
	Коннектор.УстановитьПараметры(Настройки.ПараметрыПодключения);

	Если Не Коннектор.ИнициализироватьПродюсера(Настройки.АдресБрокера) Тогда
		Статус.Успешно = Ложь;
		Статус.ТекстОшибки = Коннектор.ПолучитьСообщениеОбОшибке();
		Возврат Неопределено;
	КонецЕсли;
	
	Коннектор.УстановитьРежимАсинх(Настройки.РежимАсинх);
	
	Возврат Коннектор;
		
КонецФункции

Функция СессияПродюсера(Продюсер, Сессии, Статус)
	
	Если Сессии = Неопределено Тогда
		Возврат НовыйКоннекторПродюсера(Продюсер, Статус);
		
	Иначе
		Сессия = Сессии.Получить(Продюсер);
		Если Сессия = Неопределено Тогда
			Сессия = НовыйКоннекторПродюсера(Продюсер, Статус);
			Сессии.Вставить(Продюсер, Сессия);
		КонецЕсли;
		Возврат Сессия;
		
	КонецЕсли;
	
КонецФункции

#КонецОбласти

#Область ЧтениеСообщений

Функция ОписаниеПолученногоСообщения()
	
	Результат = Новый Структура;
	Результат.Вставить("Тело", "");
	Результат.Вставить("Ключ", "");
	Результат.Вставить("Заголовки", Новый Массив);
	Результат.Вставить("Топик", "");
	Результат.Вставить("ВременнаяМетка", 0);
	Результат.Вставить("Раздел", 0);
	Результат.Вставить("Смещение", 0);
	
	Возврат Результат;
	
КонецФункции

Функция НовыйКоннекторКонсьюмера(Консьюмер, АвтоФиксацияСмещения, Статус)
	
	Настройки = Справочники.КафкаКонсьюмеры.ОписаниеКонсьюмера(Консьюмер);
	Если Не ЗначениеЗаполнено(Настройки.Ссылка) Тогда
		Статус.Успешно = Ложь;
		Статус.ТекстОшибки = НСтр("ru = 'Консьюмер отключён!'", "ru");
		Возврат Неопределено;
	КонецЕсли;
	
	// Параметры подключения
	Параметры = Настройки.ПараметрыПодключения;
	// Идентификатор группы клиентов
	Параметры.Вставить("group.id", Настройки.Идентификатор);
	Параметры.Вставить("enable.auto.commit", ?(АвтоФиксацияСмещения, "true", "false"));
	
	Коннектор = Обработки.КафкаИнтеграция.Создать();
	УстановитьКаталогЛогов(Коннектор);
	Коннектор.УстановитьПараметры(Параметры);
	
//	ТекущиеСмещения = Коннектор.ПолучитьСмещенияГруппыКонсьюмеров(Настройки.АдресБрокера);

	// Инициализация консьюмера
	Если Не Коннектор.ИнициализироватьКонсьюмера(Настройки.АдресБрокера) Тогда
		Статус.Успешно = Ложь;
		Статус.ТекстОшибки = Коннектор.ПолучитьСообщениеОбОшибке();
		Возврат Неопределено;
	КонецЕсли;
	
	// Подписка на топики
	Если Не Коннектор.Подписаться(Настройки.Топики) Тогда
		Статус.Успешно = Ложь;
		Статус.ТекстОшибки = Коннектор.ПолучитьСообщениеОбОшибке();
		Возврат Неопределено;
	КонецЕсли;
	
	// Установка таймаута ожидания сообщений
	Если Не Коннектор.УстановитьТаймаутОжидания(Настройки.ТаймаутОжидания) Тогда
		Статус.Успешно = Ложь;
		Статус.ТекстОшибки = Коннектор.ПолучитьСообщениеОбОшибке();
		Возврат Неопределено;
	КонецЕсли;
	
	Коннектор.УстановитьРежимЧтенияДвоичныхДанных(Настройки.ДвоичныеДанные);
	
	Возврат Коннектор;
	
КонецФункции

Функция СессияКонсьюмера(Консьюмер, АвтоФиксацияСмещения, Сессии, Статус)
	
	Если Сессии = Неопределено Тогда
		Возврат НовыйКоннекторКонсьюмера(Консьюмер, АвтоФиксацияСмещения, Статус);
		
	Иначе
		Сессия = Сессии.Получить(Консьюмер);
		Если Сессия = Неопределено Тогда
			Сессия = НовыйКоннекторКонсьюмера(Консьюмер, АвтоФиксацияСмещения, Статус);
			Сессии.Вставить(Консьюмер, Сессия);
		КонецЕсли;
		Возврат Сессия;
		
	КонецЕсли;
	
КонецФункции

#КонецОбласти

#КонецОбласти
